Repository: doc-autoit-fr/omegat
Catalog: tm/auto/AutoItFr_201503.tmx
Source language: en
Languages: fr

source: Updates a brush's transformation matrix with the product of itself and another matrix
fr: Modifie la matrice de transformation d'un pinceau en la multipliant par une autre matrice, dans l'ordre indiqué

source: Pointer to a Matrix object that specifies the transformation matrix
fr: Handle de l'objet Matrix, matrice de transformation

source: 0 - The passed matrix is on the left
fr: 0 - La matrice passée est à gauche

source: 1 - The passed matrix is on the right
fr: 1 - La matrice passée est à droite

source: False and sets the @error flag to non-zero, @extended may contain GPSTATUS error code error code ($GPID_ERR*).
fr: Retourne False et @error <> 0, @extended contient le code erreur GPSTATUS ($GPID_ERR*).

source: Search GdipMultiplyLineTransform in MSDN Library
fr: Consultez GdipMultiplyLineTransform dans la Librairie MSDN.

source: Resets the transformation matrix of a linear gradient brush to the identity matrix
fr: Réinitialise la matrice de transformation d'un pinceau à dégradé linéaire avec la matrice d'identité

source: Search GdipResetLineTransform in MSDN Library
fr: Consultez GdipResetLineTransform dans la Librairie MSDN.

source: reset angle to zero
fr: Initialise l'angle à zéro

source: Sets the starting color and ending color of a linear gradient brush
fr: Définit la couleur de début et la couleur de fin d'un pinceau à dégradé linéaire

source: Alpha, Red, Green and Blue components of the starting color
fr: Composantes Alpha, Rouge, Vert et Bleu de la couleur de début

source: Alpha, Red, Green and Blue components of the ending color
fr: Composantes Alpha, Rouge, Vert et Bleu de la couleur de fin

source: Search GdipSetLineColors in MSDN Library
fr: Consultez GdipSetLineColors dans la Librairie MSDN.

source: Using 4 factors and position
fr: Utilise 4 facteurs et 4 emplacements

source: Factor
fr: Facteur

source: Position
fr: Emplacement

source: The percentage of the blending is 100% (red to green is gradually completed in just 20% from the left)
fr: Le pourcentage du mélange est de 100% (le dégradé du rouge au vert est progressivement complété dans seulement 20% à partir de la gauche)

source: The distance percentage from the left boundary of the brush is 20%
fr: Le pourcentage de la distance de la frontière gauche du pinceau est de 20%

source: The percentage of the blending is 0% (green to red is gradually completed from 20% to 70% from the left)
fr: Le pourcentage de mélange est de 0% (le dégradé du vert au rouge passe progressivement de 20% à 70 % à partir la gauche)

source: The distance percentage from the left boundary of the brush is 70%
fr: Le pourcentage de la distance de la frontière gauche du pinceau est de 70%

source: The percentage of the blending is 100% (red to green is gradually completed from 70% to 100% from the left)
fr: Le pourcentage de mélange est de 100% (le dégradé du rouge au vert est progressivement complété de 70% à 100 % à partir de la gauche

source: The distance percentage from the left boundary of the brush is 100%
fr: Le pourcentage de la distance de la frontière gauche du pinceau est à 100%

source: set the linear gradient brush color positions and factors
fr: Définit les emplacements de couleurs de pinceau de dégradé linéaire et les facteurs

source: change the color values to greyscale
fr: Change les valeurs des couleurs en niveaux de gris

source: Specifies whether gamma correction is enabled for a linear gradient brush
fr: Active / désactive la correction gamma d'un pinceau à dégradé linéaire

source: If True, gamma correction is enabled; otherwise gamma correction is disabled
fr: Si True, la correction gamma est activée, sinon elle est désactivée

source: By default, gamma correction is disabled during creation of a LinearGradientBrush object.
fr: Par défaut, la correction gamma est désactivée lors de la création d'un objet LinearGradientBrush.

source: Gamma correction is often done to match the intensity contrast of the gradient to the ability of the human eye to perceive intensity changes.
fr: La correction gamma est souvent utilisée pour adapter l'intensité du contraste du dégradé avec la capacité de l'oeil humain à percevoir les changements d'intensité.

source: Search GdipSetLineGammaCorrection in MSDN Library
fr: Consultez GdipSetLineGammaCorrection dans la Librairie MSDN.

source: draw the filled rectangle
fr: Dessine le rectangle coloré

source: Sets the blend shape of a linear gradient brush to create a custom blend based on a triangular shape
fr: Pour un pinceau à dégradé linéaire existant, définit la manière de fusionner les deux couleurs selon une courbe en triangle.

source: Number in the range 0.0 to 1.0 that specifies the position of the ending color
fr: Nombre compris entre 0.0 et 1.0 qui spécifie la zone dans laquelle la couleur est progressivement dégradée de la couleur de début à un pourcentage de la couleur de fin

source: Number in the range 0.0 to 1.0 that specifies the percentage of the gradient's ending color that gets blended, at the focus position, with the gradient's starting color.
fr: Nombre compris entre 0.0 à 1.0 qui indique le pourcentage (/100) de la couleur de fin que le dégradé atteindra progressivement par fusion avec la couleur de début du dégradé.

source: The default value is 1, which specifies that the ending color is at full intensity
fr: La valeur par défaut est 1, ce qui signifie que la couleur de fin de zone est en pleine intensité

source: Search GdipSetLineLinearBlend in MSDN Library
fr: Consultez GdipSetLineLinearBlend dans la Librairie MSDN.

source: Sets the colors to be interpolated for a linear gradient brush and their corresponding blend positions
fr: Pour un pinceau à dégradé linéaire existant, définit les couleurs à mélanger et les positions correspondantes

source: Array of blend colors and blend positions:
fr: Tableau de couleurs à mélanger et positions correspondantes:

source: [0][0] - Number of blend colors and blend positions, must be at least 2
fr: [0][0] - Le nombre de paires (couleur,position), doit être d'au moins 2

source: [1][0] - Color 1
fr: [1][0] - Couleur 1

source: [2][0] - Color 2
fr: [2][0] - Couleur 2

source: [n][0] - Color n
fr: [n][0] - Couleur n

source: Search GdipSetLinePresetBlend in MSDN Library
fr: Consultez GdipSetLinePresetBlend dans la Librairie MSDN.

source: create line brush
fr: Crée un pinceau

source: define the interpolated colors and positions
fr: Définit les couleurs interpolées et les emplacements

source: Red
fr: Rouge

source: 0% from the left
fr: 0 % à partir de la gauche

source: Green
fr: Vert

source: To 30% from the left
fr: Jusqu'à 30 % à partir de la gauche

source: Blue
fr: Bleu

source: To 70% from the left
fr: Jusqu'à 70% à partir de la gauche

source: Yellow
fr: Jaune

source: To 100% from the left
fr: Jusqu'à 100% à partir de la gauche

source: set the linear gradient brush colors and position
fr: Définir les couleurs et les emplacements de pinceau de dégradé linéaire

source: draw bitmap to screen
fr: Dessine le bitmap à l'écran

source: Sets the blend shape of a linear gradient brush to create a custom blend based on a bell-shaped curve
fr: Pour un pinceau à dégradé linéaire existant, définit la manière de mélanger les deux couleurs selon une courbe en forme de cloche

source: Number in the range 0.0 to 1.0 that specifies the percentage of the gradient's ending
fr: Nombre compris entre 0.0 à 1.0 qui indique le pourcentage (/100) de la couleur de fin que le dégradé atteindra progressivement par fusion avec la couleur de début du dégradé.

source: Search GdipSetLineSigmaBlend in MSDN Library
fr: Consultez GdipSetLineSigmaBlend dans la Librairie MSDN.

source: Sets the transformation matrix of a linear gradient brush
fr: Pour un pinceau à dégradé linéaire existant, définit la matrice de transformation des couleurs

source: Search GdipSetLineTransform in MSDN Library
fr: Consultez GdipSetLineTransform dans la Librairie MSDN.

source: Clones a Matrix object
fr: Clone un objet Matrix

source: Pointer to a Matrix object
fr: Handle de l'objet Matrix

source: a handle to a new cloned Matrix object
fr: Retourne le handle du nouvel objet Matrix cloné

source: After you are done with the object, call _GDIPlus_MatrixDispose() to release the object resources
fr: Lorsque vous en avez terminé avec l'objet, appelez _GDIPlus_MatrixDispose() pour libérer les ressources de l'objet

source: Search GdipCloneMatrix in MSDN Library
fr: Consultez GdipCloneMatrix dans la Librairie MSDN.

source: Creates and initializes a Matrix object that represents the identity matrix
fr: Crée et initialise un objet Matrix avec la matrice identité

source: a handle to a Matrix object.
fr: Retourne le handle de l'objet Matrix.

source: When you are done with the matrix, call _GDIPlus_MatrixDispose() to release the resources.
fr: Lorsque vous en avez terminé avec la matrice, appelez _GDIPlus_MatrixDispose() pour libérer les ressources.

source: Search GdipCreateMatrix in MSDN Library
fr: Consultez GdipCreateMatrix dans la Librairie MSDN.

source: Release a matrix object
fr: Libère un objet Matrix

source: Handle to a Matrix object
fr: Handle de l'objet Matrix

source: Search GdipDeleteMatrix in MSDN Library
fr: Consultez GdipDeleteMatrix dans la Librairie MSDN.

source: Gets the elements of a matrix
fr: Obtient les éléments d'une matrice

source: an array of the elements of the matrix:
fr: Retourne le tableau des éléments de la matrice:

source: [0] - Row 1, column 1
fr: [0] - Ligne 1, colonne 1

source: [1] - Row 1, column 2
fr: [1] - Ligne 1, colonne 2

source: [2] - Row 2, column 1
fr: [2] - Ligne 2, colonne 1

source: [3] - Row 2, column 2
fr: [3] - Ligne 2, colonne 2

source: [4] - Row 3, column 1
fr: [4] - Ligne 3, colonne 1

source: [5] - Row 3, column 2
fr: [5] - Ligne 3, colonne 2

source: Search GdipGetMatrixElements in MSDN Library
fr: Consultez GdipGetMatrixElements dans la Librairie MSDN.

source: Replaces the elements of a matrix with the elements of its inverse
fr: Remplace les éléments d'une matrice par les éléments de son inverse

source: Search GdipInvertMatrix in MSDN Library
fr: Consultez GdipInvertMatrix dans la Librairie MSDN.

source: Invert matrix
fr: Inverse la matrice

source: Transform Mouseposition by inverted matrix back to original image
fr: Transforme MousePosition par matrice la inverse pour revenir à l'image originale

source: Updates a matrix with the product of itself and another matrix
fr: Remplace les coefficients d'une matrice par les coefficients du produit d'elle-même avec une autre matrice

source: Pointer to a Matrix object that will be multiplied by the first matrix
fr: Handle de l'objet Matrix qui sera multiplié par la première matrice

source: 0 - The second matrix is on the left
fr: 0 - La seconde matrice est à gauche

source: 1 - The second matrix is on the right
fr: 1 - La seconde matrice est à droite

source: Search GdipMultiplyMatrix in MSDN Library
fr: Consultez GdipMultiplyMatrix dans la Librairie MSDN.

source: Updates a matrix with the product of itself and a rotation matrix
fr: Remplace les coefficients d'une matrice par les coefficients du produit d'elle-même avec une matrice de rotation

source: The angle of rotation in degrees.
fr: L'angle de rotation en degrés.

source: Positive values specify clockwise rotation.
fr: Les valeurs positives indiquent une rotation dans le sens horaire.

source: Specifies the order of the multiplication:
fr: Ordre de multiplication des matrices:

source: True - Specifies that the rotation matrix is on the left
fr: True - Indique que la matrice de rotation est à gauche

source: False - Specifies that the rotation matrix is on the right
fr: False - Indique que la matrice de rotation est à droite

source: Search GdipRotateMatrix in MSDN Library
fr: Consultez GdipRotateMatrix dans la Librairie MSDN.

source: Updates a matrix with the product of itself and a scaling matrix
fr: Remplace les coefficients d'une matrice par les coefficients du produit d'elle-même avec une matrice de mise à l'échelle, dans l'ordre spécifié

source: Multiplier to scale the x-axis
fr: Multiplicateur de mise à l'échelle suivant l'axe x

source: Multiplier to scale the y-axis
fr: Multiplicateur de mise à l'échelle suivant l'axe y

source: True - Specifies that the scaling matrix is on the left
fr: True - Indique que la matrice de mise à l'échelle est à gauche

source: False - Specifies that the scaling matrix is on the right
fr: False - Indique que la matrice de mise à l'échelle est à droite

source: Search GdipScaleMatrix in MSDN Library
fr: Consultez GdipScaleMatrix dans la Librairie MSDN.

source: Start GDI+
fr: Lancer GDI+

source: Take Screenshot at bottom left of screen
fr: Fait une capture d'écran en bas à gauche de l'écran

source: Scale the matrix by 2 (everything will get 2x larger)
fr: Met à l'échelle la matrice avec un coéfficient 2 (tout sera 2 fois plus grand)

source: Sets the elements of a matrix
fr: Définit les éléments d'une matrice

source: A floating point number value.
fr: Un nombre à virgule flottante.

source: Default is 1
fr: Par défaut, 1

source: Default is 0
fr: Par défaut, 0

source: Search GdipSetMatrixElements in MSDN Library
fr: Consultez GdipSetMatrixElements dans la Librairie MSDN.

source: Tranform Path to fit to window
fr: Transforme le Path pour s'adapter à la fenêtre

source: Get bounding rectangle of the path
fr: Obtient le rectangle de délimitation du Path

source: Translate Matrix to the offset of the bounding rectangle
fr: Matrice de translation pour l'offset du rectangle de délimitation

source: Scale Matrix
fr: Matrice de mise à l'échelle

source: Translate and Scale Path
fr: Translate et met à l'échelle le Path

source: Tranform Path to center the path
fr: Transforme le Path pour le centrer

source: Reset Path (delete previous string)
fr: Réinitialise le Path (supprime chaîne précédente)

source: Reset Matrix
fr: Réinitialise la matrice

source: Translate (offset) Path
fr: Translate (offset) le Path

source: Real number that specifies the horizontal shear factor
fr: Nombre qui spécifie le facteur d'inclinaison horizontale

source: Real number that specifies the vertical shear factor
fr: Nombre qui spécifie le facteur d'inclinaison verticale

source: False.
fr: Retourne False.

source: Search GdipShearMatrix in MSDN Library
fr: Consultez GdipShearMatrix dans la Librairie MSDN.

source: Multiplies each point in an array by a matrix
fr: Multiplie chaque point d'un tableau par une matrice

source: Array of points to be transformed:
fr: Tableau de points à transformer:

source: [1][0] - Point 1 X coordinate
fr: [1][0] - Point 1, coordonnée X

source: [1][1] - Point 1 Y coordinate
fr: [1][1] - Point 1, coordonnée Y

source: [2][0] - Point 2 X coordinate
fr: [2][0] - Point 2, coordonnée X

source: [2][1] - Point 2 Y coordinate
fr: [2][1] - Point 2, coordonnée Y

source: [n][0] - Point n X coordinate
fr: [n][0] - Point n, coordonnée X

source: [n][1] - Point n Y coordinate
fr: [n][1] - Point n, coordonnée Y

source: Each point in the array is treated as a row matrix.
fr: Chaque point du tableau est considéré comme une matrice ligne.

source: The multiplication is performed with the row matrix on the left and the matrix on the right.
fr: La multiplication est effectuée avec la matrice ligne à gauche et de la matrice carrée à droite.

source: Search GdipTransformMatrixPoints in MSDN Library
fr: Consultez GdipTransformMatrixPoints dans la Librairie MSDN.

source: Updates a matrix with the product of itself and a translation matrix
fr: Remplace les coefficients d'une matrice par les coefficients du produit d'elle-même par une matrice de translation

source: Amount of pixels to add along the x-axis
fr: Nombre de pixels à ajouter le long de l'axe x

source: Amount of pixels to add along the y-axis
fr: Nombre de pixels à ajouter le long de l'axe y

source: True - Specifies that the translation matrix is on the left
fr: True - La matrice de translation est à gauche

source: False - Specifies that the translation matrix is on the right
fr: False - La matrice de translation est à droite

source: Search GdipTranslateMatrix in MSDN Library
fr: Consultez GdipTranslateMatrix dans la Librairie MSDN.

source: Move the matrix half the width and helf the height towards the center
fr: Matrice de translation de la moitié de la largeur de la fenêtre et de la moitié de la hauteur

source: Draw around upper left corner of the GUI, but since we have translated the matrix the object will appear at the center of GUI
fr: Dessine autour du coin supérieur gauche de la gui, mais depuis que nous avons translaté la matrice l'objet apparaît au centre de la gui

source: Initializes a standard, optimal, or custom color palette
fr: Initialise palette de couleur standard, optimale, ou personnalisée

source: Number of Entries.
fr: Nombre d'entrées.

source: PaletteType constant that specifies the palette type ($GDIP_PaletteType*).
fr: Constante PaletteType qui spécifie le type de palette ($GDIP_PaletteType*).

source: Integer that specifies the number of colors you want to have in an optimal palette based on a specified bitmap.
fr: Entier qui spécifie le nombre de couleurs que vous voulez avoir dans une palette optimale basée sur un bitmap spécifié.

source: If this parameter is greater than 0, the palettetype parameter must be set to PaletteTypeOptimal and the bitmap parameter must point to a Bitmap object.
fr: Si ce paramètre est supérieur à 0, le paramètre palettetype doit être réglé sur PaletteTypeOptimal et le paramètre bitmap doit pointer sur un objet Bitmap.

source: Boolean value that specifies whether to include the transparent color in the palette.
fr: Valeur booléenne qui spécifie s'il faut inclure la couleur transparente dans la palette.

source: Set to TRUE to include the transparent color; otherwise FALSE.
fr: Réglez à TRUE pour inclure la couleur transparente; FALSE sinon.

source: Handle of a Bitmap object for which an optimal palette will be created.
fr: Handle de l'objet Bitmap pour lequel une palette optimale sera créée.

source: a DllStruct Palette:
fr: Retourne une palette DllStruct:

source: ARGB - UINT Array of ARGB colors
fr: ARGB - tableau de UINT de couleurs ARGB

source: Search GdipInitializePalette in MSDN Library
fr: Consultez GdipInitializePalette dans la Librairie MSDN.

source: Add a value to an encoder parameter list
fr: Ajouter une valeur à la liste des paramètres d'un encodeur

source: $tagGDIPENCODERPARAMS structure returned from _GDIPlus_ParamInit()
fr: Structure $tagGDIPENCODERPARAMS retournée par _GDIPlus_ParamInit()

source: Encoder parameter GUID.
fr: Paramètre GUID de l'encoder.

source: $GDIP_EPGCHROMINANCETABLE - Chrominance table settings
fr: $GDIP_EPGCHROMINANCETABLE - paramètres de la table de chrominance

source: $GDIP_EPGCOLORDEPTH - Color depth settings
fr: $GDIP_EPGCOLORDEPTH - paramètres de profondeur de couleur

source: $GDIP_EPGCOMPRESSION - Compression settings
fr: $GDIP_EPGCOMPRESSION - paramètres de compression

source: $GDIP_EPGLUMINANCETABLE - Luminance table settings
fr: $GDIP_EPGLUMINANCETABLE - paramètres de la table de luminance

source: $GDIP_EPGQUALITY - Quality settings
fr: $GDIP_EPGQUALITY - paramètres de qualité

source: $GDIP_EPGRENDERMETHOD - Render method settings
fr: $GDIP_EPGRENDERMETHOD - paramètres de la méthode Render

source: $GDIP_EPGSAVEFLAG - Save flag settings
fr: $GDIP_EPGSAVEFLAG - paramètres d'enregistrement de flag

source: $GDIP_EPGSCANMETHOD - Scan mode settings
fr: $GDIP_EPGSCANMETHOD - paramètres du mode numérisation

source: $GDIP_EPGTRANSFORMATION - Transformation settings
fr: $GDIP_EPGTRANSFORMATION - paramètres de transformation

source: $GDIP_EPGVERSION - Software version settings
fr: $GDIP_EPGVERSION - paramètres de version du logiciel

source: Number of elements in the $pValues array
fr: Nombre d'éléments du tableau $pValues

source: Encoder parameter value type.
fr: Type de valeur des paramètres de l'encodeur.

source: $GDIP_EPTBYTE - 8 bit unsigned integer
fr: $GDIP_EPTBYTE - Integer 8 bits non signé

source: $GDIP_EPTASCII - Null terminated character string
fr: $GDIP_EPTASCII - Chaîne de caractères terminée par Null

source: $GDIP_EPTSHORT - 16 bit unsigned integer
fr: $GDIP_EPTSHORT - Integer 16 bits non signé

source: $GDIP_EPTLONG - 32 bit unsigned integer
fr: $GDIP_EPTLONG - Integer 32 bits non signé

source: $GDIP_EPTRATIONAL - Two longs (numerator, denominator)
fr: $GDIP_EPTRATIONAL - Deux 'longs' (numérateur, dénominateur)

source: $GDIP_EPTLONGRANGE - Two longs (low, high)
fr: $GDIP_EPTLONGRANGE - Deux 'longs' (inférieur, supérieur)

source: $GDIP_EPTUNDEFINED - Array of bytes of any type
fr: $GDIP_EPTUNDEFINED - Tableau d'octets de n'importe quel type

source: $GDIP_EPTRATIONALRANGE - Two longs (low, high)
fr: $GDIP_EPTRATIONALRANGE - Deux 'longs' (inférieur, supérieur)

source: Pointer to an array of values.
fr: Pointeur sur le tableau de valeurs.

source: Each value has the type specified by the $iType data member.
fr: Chaque valeur a le type spécifié par le membre de données $iType.

source: Allocate an empty encoder parameter list
fr: Alloue une liste vide de paramètres d'un encodeur

source: The total number of $tagGDIPENCODERPARAM that the list can contain
fr: Le nombre total de $tagGDIPENCODERPARAM que la liste peut contenir

source: In order to pass parameters to any of the encoder functions, you must use an encoder parameter list.
fr: Afin de passer des paramètres à l'une des fonctions de l'encodeur, vous devez utiliser une liste de paramètres de l'encodeur.

source: This function is used to allocate an encoder parameter list that can then be passed to _GDIPlus_ParamAdd() to add the actual parameters.
fr: Cette fonction est utilisée pour attribuer une liste de paramètres à l'encodeur qui peut ensuite être transmis à _GDIPlus_ParamAdd() pour les ajouter aux paramètres actuels.

source: Get an encoder parameter size
fr: Obtient la taille d'un paramètre d'un encodeur

source: Returns the size of $tagGDIPENCODERPARAM structure.
fr: Retourne la taille de la structure $tagGDIPENCODERPARAM.

source: Take care of the x86/X64 dependancy.
fr: Cette taille dépend du support x86/x64.

source: Useful when retrieving entries in a $tagGDIPENCODERPARAMS structure.
fr: Utile lorsqu'on récupère les entrées dans une structure $tagGDIPENCODERPARAMS.

source: Adds an elliptical arc to the current figure of a path
fr: Ajoute un arc elliptique à la figure actuelle d'un tracé

source: Pointer to a GraphicsPath object
fr: Handle de l'objet GraphicsPath

source: X coordinate of the upper-left corner of the ellipse that contains the arc
fr: Coordonnée X du coin supérieur gauche de l'ellipse qui contient l'arc

source: Y coordinate of the upper-left corner of the ellipse that contains the arc
fr: Coordonnée Y du coin supérieur gauche de l'ellipse qui contient l'arc

source: Width of the bounding rectangle for the ellipse that contains the arc
fr: Largeur du rectangle de délimitation de l'ellipse qui contient l'arc

source: Height of the bounding rectangle for the ellipse that contains the arc
fr: Hauteur du rectangle de délimitation de l'ellipse qui contient l'arc

source: The angle, in degrees, between the X axis and the starting point of the arc
fr: L'angle, en degrés, entre l'axe X et le point de départ de l'arc

source: The angle, in degrees, between the starting and ending points of the arc
fr: L'angle, en degrés, entre les points de début et de fin de l'arc

source: Search GdipAddPathArc in MSDN Library
fr: Consultez GdipAddPathArc dans la Librairie MSDN.

source: connect last point of arc2 to first point of arc1
fr: Connecte le dernier point de ARC2 au premier point de ARC1

source: do not connect arcs
fr: Ne connecte pas l'arc

source: connect last point of arc2 to first point of arc2
fr: Connecte le dernier point de ARC2 au premier point de ARC2
